### 1. Pandas DataFrame:
- DataFrame is used to store the data in the form rows and columns.
- It is similar to 2-D array.
- To create the DataFrame using dictionary,2-D numpy.
- DataFrame are imported as .csv files,.txt,.excel...

In [1]:
import pandas as pd

In [4]:
# To create the dataframe using diciotnary..
d1 = {'Name':['mani','krishna','nethra'],
      'Rno':[510,423,560],
      'Branch':['cse','ece','eee']}
df = pd.DataFrame(d1)
df

      Name  Rno Branch
0     mani  510    cse
1  krishna  423    ece
2   nethra  560    eee

In [5]:
# To create the DataFrame using 2-d numpy array..
import numpy as np
n1 = np.array([[1,2,3],[4,5,6]])
df2 =pd.DataFrame(n1)
df2

   0  1  2
0  1  2  3
1  4  5  6

In [6]:
df

      Name  Rno Branch
0     mani  510    cse
1  krishna  423    ece
2   nethra  560    eee

In [7]:
# To print the DataFrame column names?
df.columns

Index(['Name', 'Rno', 'Branch'], dtype='object')

In [9]:
# To print the DataFrame row values?
df.values

array([['mani', 510, 'cse'],
       ['krishna', 423, 'ece'],
       ['nethra', 560, 'eee']], dtype=object)

In [10]:
# To print the dataframe number of rows?
print(len(df.values))

3

In [11]:
# To get the dataframe index names..
print(df.index)

RangeIndex(start=0, stop=3, step=1)

In [12]:
df

      Name  Rno Branch
0     mani  510    cse
1  krishna  423    ece
2   nethra  560    eee

In [15]:
# To print the number of rows and columns?
df.shape

(3, 3)

#### pandas indexing:
- To get the data from a dataframe using row indexing and column values.

In [17]:
df

      Name  Rno Branch
0     mani  510    cse
1  krishna  423    ece
2   nethra  560    eee

In [18]:
# To print the specific column data..
df['Name']

0       mani
1    krishna
2     nethra
Name: Name, dtype: object

In [20]:
# To print the dataframe with different columns?
df[['Name','Branch']]

      Name Branch
0     mani    cse
1  krishna    ece
2   nethra    eee

In [21]:
# To print the first five records?
df.head()

      Name  Rno Branch
0     mani  510    cse
1  krishna  423    ece
2   nethra  560    eee

In [22]:
# To print the first two records?
df.head(2)

      Name  Rno Branch
0     mani  510    cse
1  krishna  423    ece

In [23]:
df.head(1) # To get the first record

   Name  Rno Branch
0  mani  510    cse

In [27]:
# To print the last record from a dataframe?
df.tail(1)

     Name  Rno Branch
2  nethra  560    eee

In [28]:
df.tail() # To print the last five records

      Name  Rno Branch
0     mani  510    cse
1  krishna  423    ece
2   nethra  560    eee

In [29]:
df.iloc[1,1]
# To get the specific value

423

In [30]:
df.Rno[1]

423

In [31]:
df.loc[(df['Rno']==423)]

      Name  Rno Branch
1  krishna  423    ece

In [34]:
df.loc[(df["Rno"]<100) & (df["Rno"]<=500)]

Empty DataFrame
Columns: [Name, Rno, Branch]
Index: []

In [35]:
df

      Name  Rno Branch
0     mani  510    cse
1  krishna  423    ece
2   nethra  560    eee

In [36]:
# To add the new row record?
df.loc[4]=['adyan',420,'ece']
df

      Name  Rno Branch
0     mani  510    cse
1  krishna  423    ece
2   nethra  560    eee
4    adyan  420    ece

In [40]:
df = df.append(['mythri',223,'eee'],ignore_index=True)
df

        0 Branch     Name    Rno
0     NaN    cse     mani  510.0
1     NaN    ece  krishna  423.0
2     NaN    eee   nethra  560.0
3     NaN    ece    adyan  420.0
4  mythri    NaN      NaN    NaN
5     223    NaN      NaN    NaN
6     eee    NaN      NaN    NaN
7  mythri    NaN      NaN    NaN
8     223    NaN      NaN    NaN
9     eee    NaN      NaN    NaN

In [42]:
df.drop(0,axis=1,inplace=True)
df

  Branch     Name    Rno
0    cse     mani  510.0
1    ece  krishna  423.0
2    eee   nethra  560.0
3    ece    adyan  420.0
4    NaN      NaN    NaN
5    NaN      NaN    NaN
6    NaN      NaN    NaN
7    NaN      NaN    NaN
8    NaN      NaN    NaN
9    NaN      NaN    NaN

In [43]:
df.dropna()

  Branch     Name    Rno
0    cse     mani  510.0
1    ece  krishna  423.0
2    eee   nethra  560.0
3    ece    adyan  420.0

In [47]:

df.dropna(inplace=True)
df

  Branch     Name    Rno
0    cse     mani  510.0
1    ece  krishna  423.0
2    eee   nethra  560.0
3    ece    adyan  420.0

In [48]:
# To add new column to DataFrame?
df['Course']=['java','python','clanguage','Data Analysis']
df

  Branch     Name    Rno         Course
0    cse     mani  510.0           java
1    ece  krishna  423.0         python
2    eee   nethra  560.0      clanguage
3    ece    adyan  420.0  Data Analysis

In [49]:
# To update the specific value..
df.loc[1,'Course']='Django'
df

  Branch     Name    Rno         Course
0    cse     mani  510.0           java
1    ece  krishna  423.0         Django
2    eee   nethra  560.0      clanguage
3    ece    adyan  420.0  Data Analysis

In [53]:
print(df.iloc[1,1]) # integer paremeter both rows and columns
print(df.loc[1,'Name']) # row names -> integers , column values

krishna
krishna

In [54]:
# To print the only specific row record?
df.iloc[1]

Branch        ece
Name      krishna
Rno         423.0
Course     Django
Name: 1, dtype: object

In [55]:
df.loc[3]

Branch              ece
Name              adyan
Rno               420.0
Course    Data Analysis
Name: 3, dtype: object

In [56]:
df

  Branch     Name    Rno         Course
0    cse     mani  510.0           java
1    ece  krishna  423.0         Django
2    eee   nethra  560.0      clanguage
3    ece    adyan  420.0  Data Analysis

In [59]:
df.iloc[:,0]

0    cse
1    ece
2    eee
3    ece
Name: Branch, dtype: object

In [61]:
df.loc[:,'Branch']

0    cse
1    ece
2    eee
3    ece
Name: Branch, dtype: object

In [64]:
df['Branch']

0    cse
1    ece
2    eee
3    ece
Name: Branch, dtype: object

In [65]:
# To delete the data from a dataframe?
# using drop() method 
# here ->  axis = 0 -> It is row based working.
# axis = 1 -> It is column based working.
df

  Branch     Name    Rno         Course
0    cse     mani  510.0           java
1    ece  krishna  423.0         Django
2    eee   nethra  560.0      clanguage
3    ece    adyan  420.0  Data Analysis

In [66]:
# To delete the first row record?
df.drop(1,axis=0,inplace=True)
df

  Branch    Name    Rno         Course
0    cse    mani  510.0           java
2    eee  nethra  560.0      clanguage
3    ece   adyan  420.0  Data Analysis

In [67]:
# To delete the specific column record?
df.drop('Branch',axis=1,inplace=True)
df

     Name    Rno         Course
0    mani  510.0           java
2  nethra  560.0      clanguage
3   adyan  420.0  Data Analysis

In [74]:
df.drop((df.loc[2,'Rno']),inplace=True,axis=(0,1))
df

ValueError: No axis named (0, 1) for object type DataFrame

In [75]:
# To rename the particular single column name?
df

     Name    Rno         Course
0    mani  510.0           java
2  nethra  560.0      clanguage
3   adyan  420.0  Data Analysis

In [76]:
# To rename the single column name?
df.rename(columns={'Rno':'Roll number'},inplace=True)
df

     Name  Roll number         Course
0    mani        510.0           java
2  nethra        560.0      clanguage
3   adyan        420.0  Data Analysis